/** @format */

//Example 1 - Математичні оператори
//Виведи на екран загальну кількість яблук та винограду. Різницю яблук та винограду.

//const apples = 47;
//const grapes = 135;
//const total = Number(apples + grapes);
//console.log(total);
//const diff = Number(apples - grapes);
//console.log(diff);
//==============================================================================================//
//Example 2 - Комбіновані оператори
//Заміни вираз перевизначення комбінованим оператором +=.

//let students = 100;
//students += 50;
//console.log(students);
//==============================================================================================//
//Example 3 - Пріоритет операторів
//Розбери пріоритет операторів в інструкції привласнення значення змінної result.

//const result = 108 + 223 - 2 * 5;
//console.log(result);
//==============================================================================================//
//Example 4 - Клас Math
//Напиши скрипт, який виводить у консоль заокруглені вгору/вниз і т.д. значення змінної value. Використовуй методи Math.floor(), Math.ceil() та Math.round(). Перевір що буде в консолі при значеннях 27.3 та 27.9.
//const value = 27.5;
//console.log(Math.floor(value));
//console.log(Math.ceil(value));
//console.log(Math.round(value));
//==============================================================================================//
//Example 5 - Шаблонні рядки
//Склади фразу за допомогою шаблонних рядків A has B bots in stock, де A, B - змінні вставлені в рядок.

//const companyName = "Cyberdyne Systems";
//const repairBots = 150;
//const defenceBots = 50;
//const message = `${companyName} has ${repairBots + defenceBots} bots in stock`;
//console.log(message); // "Cyberdyne Systems has 200 bots in stock"
//==============================================================================================//
//Example 6 - Методи рядків та чейнінг
//Напиши скрипт, який розраховує індекс маси тіла людини. Для цього необхідно розділити вагу в кілограмах на квадрат висоти людини у метрах.

//Вага та висота зберігаються у змінних weight та height, але не як числа, а в вигляді рядків (спеціально для завдання). Не цілі числа можуть бути задані у вигляді 24.7 або 24,7, тобто як роздільник дробової частини може бути кома.

//Індекс маси тіла необхідно округлити до однієї цифри після коми;

//let weight = "88,3";
//let height = "1.75";

//weight = weight.replace(",", ".");
//height = height.replace(",", ".");

//const bmi = weight / (height * height);
//console.log(bmi.toFixed(1)); // 28.8
//==============================================================================================//
//Example 7 - Оператори порівняння та приведення типів
//Яким буде результат виразів?

//console.log(5 > 4);

//console.log(10 >= "7");

//console.log("2" > "12");

//console.log("2" < "12");

//console.log("4" == 4);

//console.log("6" === 6);

//console.log("false" === false);

//console.log(1 == true);

//console.log(1 === true);

//console.log("0" == false);

//console.log("0" === false);

//console.log("Papaya" < "papaya");

//console.log("Papaya" === "papaya");

//console.log(undefined == null);

//console.log(undefined === null);
//==============================================================================================//
//Example 8 - Логічні оператори
//Яким буде результат виразів?

//console.log(true && 3);

//console.log(false && 3);

//console.log(true && 4 && "kiwi");

//console.log(true && 0 && "kiwi");

//console.log(true || 3);

//console.log(true || 3 || 4);

//console.log(true || false || 7);

//console.log(null || 2 || undefined);

//console.log((1 && null && 2) > 0);

//console.log(null || (2 && 3) || 4);
//==============================================================================================//
//Example 9 - Значення за замовчуванням та оператор нульового злиття
//Отрефактори код так, щоб у змінну value присвоювалося значення змінної incomingValue, якщо воно не рівне undefined або null. В іншому /випадку має присвоюватися значення defaultValue. Перевір роботу скрипта для наступних значень змінної incomingValue: null, undefined, 0, false. Використовуй оператор ?? (nullish coalescing operator).

//const incomingValue = 5;
//const defaultValue = 10;
//const value = incomingValue ?? defaultValue;
//console.log(value);
//==============================================================================================//
//Example 10 - Оператор % та методи рядків
//Напиши скрипт, який переведе значення totalMinutes (кількість хвилин) в рядок у форматі годин та хвилин HH:MM.

//70 покаже 01:10
//450 покаже 07:30
//1441 покаже 24:01
//const totalMinutes = 1441;

//const hours = Math.floor(totalMinutes / 60);
//const minutes = totalMinutes % 60;
//console.log(hours);
//console.log(minutes);

//const doubleDigitHours = String(hours).padStart(2, 0);
//const doubleDigitMinutes = String(minutes).padStart(2, 0);
//console.log(`${doubleDigitHours}:${doubleDigitMinutes}`);
//==============================================================================================//
//Модуль 1. Заняття 2. Розгалуження. Цикли
//Example 1 - Введення користувача та розгалуження
//Використовуючи конструкцію if..else та prompt, напиши код, який питатиме: "Яка офіційна назва JavaScript?". Якщо користувач вводить //ECMAScript, то показуй alert з рядком "Правильно!", в іншому випадку - "Не знаєте? ECMAScript!"
//let answer = prompt("Яка офіційна назва JavaScript?");
//if (answer.toLowerCase() === "ecmascript") {
//  alert("Правильно!");
//} else {
//  alert("Не знаєте? ECMAScript!");
//}
//==============================================================================================//
//Example 2 - Відображення часу (if...else)
//Напиши скрипт для відображення годин та хвилин у консолі браузера у вигляді рядка формату "14 г. 26 хв.". Якщо значення змінної minutes дорівнює 0, то виводь рядок "14 г.", без хвилин.
//let hours = 14;
//let minutes = 26;
//let timestring;

//if (minutes > 0) {
//  timestring = `${hours} г. ${minutes} хв.`;
//} else {
//  timestring = `${hours} г.`;
//}
//console.log(timestring);
//==============================================================================================//
//Example 3 - Розгалуження
//Напиши скрипт, який виводить у консоль рядок "Це позитивне число", якщо у prompt користувач ввів число більше нуля. Якщо було введено нуль, виводь в консоль рядок "Це нуль". Якщо передали від'ємне число, у консолі повинен бути рядок "Це негативне число".

//const userInput = prompt("Введіть число");

//if (userInput > 0) {
//  alert("Це позитивне число");
//} else if (userInput == 0) {
//  alert("Це нуль");
//} else {
//  alert("Це негативне число");
//}
//==============================================================================================//
//Example 4 - Вкладені розгалуження
//Напиши скрипт, який порівнює числа у змінних a та b. Якщо обидва значення більше 100, то виведи в консоль максимальне з них. В протилежному випадку у консолі повинна бути сума значення b та числа 512.

//const a = 90;
//const b = 180;

//if (a > 100 && b > 100) {
//  console.log(Math.max(a, b));
//} else {
//  console.log(b + 512);
//}
//==============================================================================================//
//Example 5 - Форматування посилання (endsWith)
//Напиши скрипт який перевіряє чи закінчується значення змінної link символом /. Якщо ні, додай до кінця значення link цей символ. Використовуй конструкцію if...else.

//let link = "https://my-site.com/about";
//if (link.endsWith("/")) {
//  console.log(link);
//} else {
//  link += "/";
//  console.log(link);
//}
//==============================================================================================//
//Example 6 - Форматування посилання (includes та логічне «І»)
//Напиши скрипт який перевіряє чи закінчується значення змінної link символом /. Якщо ні, додай до кінця значення link цей символ, але тільки в тому випадку, якщо в link є підрядок "my-site". Використовуй конструкцію if...else.

//let link = "https://somesite.com/about";
//if (link.includes("my-site") && !link.endsWith("/")) {
//  link += "/";
//}
//console.log(link);
//==============================================================================================//
//Example 7 - Форматування посилання (тернарний оператор)
//Виконай рефакторинг коду задачі номер 4, використовуючи тернарний оператор.

//let link = "https://somesite.com/about";
//link = link.includes("my-site") && !link.endsWith("/") ? (link += "/") : link;

//console.log(link);
//==============================================================================================//
//Example 8 - if...else та логічні оператори
//Напиши скрипт який виводитиме в консоль браузера рядок залежно від значення змінної hours.

//Якщо значення змінної hours:

//менше 17, виводь рядок "Pending"
//більше або дорівнює 17 і менше або дорівнює 24, виводь рядок "Expires"
//більше 24 , виводь рядок "Overdue"

//const hours = 25;

//if (hours < 17) {
//  console.log("Pending");
//} else if (hours >= 17 && hours <= 24) {
//  console.log("Expires");
//} else {
//  console.log("Overdue");
//}
//==============================================================================================//
//Example 9 - Дедлайн здачі проекту (if...else)
//Напиши скрипт для відображення часу дедлайну здачі проекту. Використовуй конструкцію if...else.

//Якщо до дедлайну 0 днів - виведи рядок "Сьогодні"
//Якщо до дедлайну 1 день - виведи рядок "Завтра"
//Якщо до дедлайну 2 дні - виведи рядок "Післязавтра"
//Якщо до дедлайну 3+ днів - виведи рядок "Дата у майбутньому"

//const daysUntilDeadline = 0;

//if (daysUntilDeadline === 0) {
//  console.log("Сьогодні");
//} else if (daysUntilDeadline === 1) {
//  console.log("Завтра");
//} else if (daysUntilDeadline === 2) {
//  console.log("Післязавтра");
//} else {
//  console.log("Дата у майбутньому");
//}
//==============================================================================================//
//Example 10 - Дедлайн здачі проекту (switch)
//Виконай рефакторинг коду задачі номер 5 використовуючи switch.

//const daysUntilDeadline = 0;

//switch (daysUntilDeadline) {
// case 0:
//   console.log("Сьогодні");
//   break;
// case 1:
//   console.log("Завтра");
//   break;
//case 2:
//  console.log("Післязавтра");
//  break;
//default:
//  console.log("Дата у майбутньому");
//  break;
//}

//==============================================================================================//
//Example 11 - Цикл for
//Напиши цикл for, який виводить у консоль браузера числа за зростанням від min до max, але тільки якщо число кратне 5.

//const max = 100;
//const min = 20;
//for (i = min; i <= max; i++) {
//  if (i % 5 === 0) {
//    console.log(i);
//  }
//}
//==============================================================================================//
//Example 12 - Введення користувача та розгалуження
//Напиши скрипт, який питатиме логін за допомогою prompt та логувати результат у консоль браузера.

//Якщо відвідувач вводить "Адмін", то prompt запитує пароль
//Якщо нічого не введено або натиснуто клавішу Esc - вивести рядок "Скасовано"
//В іншому випадку вивести рядок "Я вас не знаю"
//Пароль перевіряти так:

//Якщо введено пароль "Я адмін", то вивести рядок "Здрастуйте!"
//Інакше виводити рядок "Невірний пароль"

//let login = prompt("Напишіть ваш логін");

//if (login === "Адмін") {
//  let password = prompt("Ввведіть ваш пароль");
//  if (password === "Я адмін") {
//    console.log("Здрастуйте!");
//  } else if (password === null || password === "") {
//    console.log("Скасовано");
//  } else {
//    console.log("Невірний пароль");
//  }
//} else if (login === "" || login === null) {
// console.log("Скасовано");
//} else {
// console.log("Я вас не знаю");
//}
//==============================================================================================//
//Модуль 2. Заняття 3. Масиви
//Example 1 - Базові операції з масивом
//Створіть масив genres з елементами «Jazz» та «Blues».
//Додайте «Рок-н-рол» до кінця.
//Виведіть у консоль перший елемент масиву.
//Виведіть у консоль останній елемент масиву. Код повинен працювати для масиву довільної довжини.
//Видаліть перший елемент та виведіть його в консоль.
//Вставте «Country» та «Reggae» на початок масиву.

//const genres = ["Jazz", "Blues"];
//genres.push("Рок - н - рол");
//console.log(genres[0]);
//console.log(genres[genres.length - 1]);
//genres.shift(0);
//console.log(genres[0]);
//genres.unshift("Country", "Reggae");
//console.log(genres);
//==============================================================================================//
//Example 2 - Масиви та рядки
//Напиши скрипт для обчислення площі прямокутника зі сторонами, значення яких зберігаються у змінній values у вигляді рядка. Значення гарантовано розділені пробілом.

//const values = "8 11";
//const [length, width] = values.split(" ").map(Number);
//const area = length * width;
//console.log(area);
//==============================================================================================//
//Example 3 - Перебір масиву
//Напиши скрипт для перебору масиву fruits циклом for. Для кожного елемента масиву виведи в консоль рядок у форматі номер_елемента: значення_елемента. Нумерація елементів повинна починатися з 1.

//const fruits = ["🍎", "🍇", "🍑", "🍌", "🍋"];
//for (i = 0; i < fruits.length; i++) {
//  console.log(`${i + 1}: ${fruits[i]}`);
//}
//==============================================================================================//
//Example 4 - Масиви та цикли
//Напиши скрипт, який виводить у консоль ім'я та телефонний номер користувача. У змінних names та phones зберігаються рядки імен та телефонних номерів, розділені комами. Порядковий номер імен та телефонів у рядках вказують на відповідність. Кількість імен та телефонів гарантовано однакова.

//const names = "Jacob,William,Solomon,Artemis";
//const phones = "89001234567,89001112233,890055566377,890055566300";
//const name = names.split(",");
//const phone = phones.split(",");
//for (i = 0; i < name.length; i++) {
//  console.log(`${name[i]}: ${phone[i]}`);
//}

//==============================================================================================//
//Example 5 - Масиви та рядки
//Напиши скрипт, який виводить у консоль усі слова рядка крім першого і останнього. Результуючий рядок не повинен починатися або закінчуватися символ пробілу. Скрипт повинен працювати для будь-якого рядка.

//const string = "Welcome to the future";
//const words = string.split(" ");
//words.shift();
//words.pop();
//const newString = words.join(" ");
//console.log(newString);
//==============================================================================================//
//Example 6 - Масиви та рядки
//Напиши скрипт, який «розгортає» рядок (зворотний порядок букв) і виводить його в консоль.

//const string = "Welcome to the future";

//const str1 = string.split("").reverse().join("");
//console.log(str1);
//==============================================================================================//
//Example 7 - Сортування масиву із циклом
//Напиши скрипт сортування масиву рядків в алфавітному порядку за першою літерою елемента.

//const langs = ["python", "javascript", "c++", "haskel", "php", "ruby"];
//for (let i = 0; i < langs.length - 1; i++) {
//  for (let j = i + 1; j < langs.length; j++) {
//    if (langs[j][0].localeCompare(langs[i][0]) < 0) {
//      const temp = langs[i];
//      langs[i] = langs[j];
//      langs[j] = temp;
//    }
//  }
//}
//console.log(langs);
//==============================================================================================//
//Example 8 - Пошук елемента
//Напиши скрипт пошуку найменшого числа у масиві. Код повинен працювати для будь-якого масиву чисел. Використовуй цикл для розв'язання задачі.

//const numbers = [2, 17, 94, 1, 23, 37];
//let min = numbers[0];

//for (let i = 1; i < numbers.length; i++) {
// if (numbers[i] < min) {
//   min = numbers[i];
// }
//}

//console.log(min);
//==============================================================================================//
