/** @format */

//Напишите функцию, которая принимает массив чисел и возвращает новый массив, содержащий только уникальные значения (т.е. значения, которые встречаются только один раз в исходном массиве).
//const number = (array) =>
// array.filter((elem, i, arr) => arr.indexOf(elem) === i);
//const array1 = [1, 2, 3, 4, 1, 2, 3, 4, 5, 6, 7, 5];
//console.log(number(array1));
//Создайте функцию, которая принимает массив объектов (каждый объект имеет свойства "имя" и "возраст") и возвращает новый массив, содержащий только объекты, у которых возраст больше 18 лет.
//const people = [
//  { name: "Alice", age: 15 },
//  { name: "Bob", age: 25 },
//  { name: "Charlie", age: 4 },
//  { name: "Dave", age: 35 },
//];
//const ageFilter = (arr) => arr.filter(({age})=> age >= 18);
//console.log(ageFilter(people));
