/** @format */

//***1***
// Робота зі змінними
// Оголосіть дві змінні: name та city.
// Присвойте значення "Іван" змінній name.
// Скопіюйте значення зі змінної name в city.
// Виведіть значення змінної city, використовуючи функцію console.log (яка повинна показати “Іван”).
//let nameN = "Ivan";
//const city = nameN;

//console.log(city);

//===============================================================================================//
//***2***
//Який буде результат виконання скрипта?
//let name = "Olga";
//console.log(`привіт ${1}`); // привіт 1
//console.log(`привіт ${"name"}`); //привіт  name
//console.log(`привіт ${name}`); //привіт Olga
//===============================================================================================//
//***3***
//Видобути число зі змінних
//let a = "5";
//let b = "13cvb";
//let c = "12.9sxdcfgv";
// вивести в консоль тип
//console.log(Number(a));
//console.log(Number.parseInt(b));
//console.log(Number.parseInt(c));
//console.log(typeof a);
//console.log(typeof b);
//console.log(typeof c);
//===============================================================================================//
//***4***
//Зробіть, щоб 0.1 + 0.2 = 0.3
//let a = 0.1;
//let b = 0.2;
//let c = a + b;
//console.log(c.toFixed([2]));
//===============================================================================================//
//***5**
//Поверніть найбільше число с набору 20, 10, 50, 40
//console.log(Math.max(20, 10, 50, 40));
//===============================================================================================//
//**6**
//Поверніть випадкове число в діапазоні від 2 до 4
//console.log(Math.random() * 2 + 2);
//===============================================================================================//
//***7**
//дізнатись довжину message
//const message = "Welcome to Bahamas!";
//console.log(message.length);
//===============================================================================================//
//***8**
//вивести в консоль message  великими літерами
//console.log(message.toUpperCase());
//===============================================================================================//
//***9**
// створити пустий об*єкт
// додати туди ім*я, вік і місто
// вивести результат в консоль
// видалити місто
// додати буль з ключем: like flowers
// вивести результат в консоль

//let obj = {
// name: "Sveta",
// age: 28,
// city: "Kharkiv",
//};

//delete obj.city;

//obj.likeFlowers = true;
//console.log(obj);
//===============================================================================================//
//***10**
// За допомогою циклу  “for…in” вивести в консоль ключі і значення об*єкта
//for (key in obj) {
//console.log(key);
//console.log(obj[key]);
//}
//===============================================================================================//
// Якщо змінна більше нуля - виведіть true, менше - false
//Перевірте це на варіантах  1, 0, -3.
//let a = 2;
//if (a > 0) {
//  console.log(true);
//} else {
//  console.log(false);
//}
//===============================================================================================//
// Якщо змінна ="test" - виведіть true,
//Перевірте це на варіантах  'test', "qwerty", true
//let b = true;
//b === "test" ? console.log(true) : console.log(false);
//===============================================================================================//
// Якщо змінна більше 10 -  відніміть 5,
//менше - додайте 5, результат виведіть в консоль
//Перевірте це на варіантах  1, 10, 13.
//let a = 13;
//if (a > 10) {
//  console.log(a - 5);
//} else {
//  console.log(a + 5);
//}
//===============================================================================================//
//Зробіть сервіс який отримує число від 1 до 12
// виведіть місяць який дорівнює числу
//function getMonth(number) {
//const months = [
//  "січня",
// "лютого",
//  "березня",
//  "квітня",
//  "травня",
//  "червня",
//  "липня",
//   "серпня",
//   "вересня",
//   "жовтня",
//   "листопада",
//   "грудня",
// ];
// if (number > 1 && number <= 12) {
//   return months[number - 1];
// } else {
//   return "Некоректне число місяця";
// }
//}
//const monthNumber = 12;
//const monthName = getMonth(monthNumber);
//console.log(`Число ${monthNumber} відповідає місяцю ${monthName}`);
//===============================================================================================//
//Зробіть сервіс який отримує тризначне число
//Поверніть користувачу сумму цих чисел
//function getNumber(number) {
// let sum = 0;
// while (number > 0) {
//   sum += number % 10;
//   number = Math.floor(number / 10);
// }
// return sum;
//}
//const input = 2345;
//const sum = getNumber(input);
//console.log(`Сума цифр числа ${input} дорівнює ${sum}`);
//===============================================================================================//
//  -- 1 --
// У вас є масив об’єктів fruts, і в кожному з них є name
// Напишіть код, який перетворює їх в масив імен.
//const fruts = [
//  { id: 0, name: "Apple" },
//  { id: 1, name: "Tomat" },
//  { id: 2, name: "Cherry" },
//  { id: 3, name: "Orange" },
//];
//const frutName = fruts.map((frut) => frut.name);
//console.log(frutName);
//===============================================================================================//
//  -- 2 --
//Виведіть парні числа від 2 до 10, використовуючи цикл for.
//for (let i = 2; i <= 10; i += 2) {
//  console.log(i);
//}
//===============================================================================================//
//  -- 3 --
//Замініть цикл "for" на "while"
//for (let i = 0; i < 5; i++) {
//  console.log(`цифра ${i}!`);
//}
//let i = 0;
//while (i < 5) {
//  console.log(`цифра ${i}!`);
//  i++;
//}
//===============================================================================================//
//  -- 4 --
//Напишіть цикл, який пропонує prompt ввести число більше за 100.
//Якщо відвідувач введе менше число – попросити ввести ще раз, і так далі.
//Цикл повинен запитувати число доти, доки відвідувач не введе число,
// більше за 100, або не скасує ввід/введе порожній рядок.
//let number;
//
//while (true) {
// number = prompt("Введіть число, більше за 100", "");

// if (number === null || number === "") {
//   break; // якщо користувач скасував ввід або ввів порожній рядок, виходимо з циклу
// }

// number = Number(number);

// if (number > 100) {
//  console.log(`Ви ввели число ${number}`);
//  break; // якщо користувач ввів число більше за 100, виходимо з циклу
// }
//}
//===============================================================================================//
//  -- 5 --
// Вирахуйте середній вік

//const girls = [
// { age: 23, name: "Оля" },
// { age: 29, name: "Аня" },
// { age: 10, name: "Юля" },
// { age: 20, name: "Катя" },
//];
//const sumOfAges = girls.reduce((total, girl) => total + girl.age, 0);
//const averageAge = sumOfAges / girls.length;

//console.log(averageAge);
